admin-panel-menu = Ты админ 👑!
                   Какой функционал доступен.

                   🔹 <b>Список героев 📜</b> — предоставляет список всех учеников для просмотра.

                   🔹 <b>➕ Начислить/➖Списать</b> — Начислить или списать баллы у группы учеников.

                   🔹 <b>🏆 Рейтинг</b> — Best of 30!
admin-panel-list-heroes = Для просмотра определенного ученика, выбери его из списка.
admin-panel-input-usernames = Введи список username'ов через запятую. Регистр не важен.
                              <i>Прим.: Thorn_Elf, Борисыч9, ZaraDark </i>
admin-panel-list-fill-usernames = Вот список найденных учеников. И только тебе решать что с ними делать.

                            🔹 <b>➕ Начислить</b> — всем: +20 XP и коины по формуле

                            🔹 <b>➖ Списать</b> — вводится сумма, списывается у всех введённых
admin-panel-list-empty-usernames = Увы, но мне не удалось найти учеников. Проверь правильность имен.
admin-panel-input-summ = Введи сумму для списания.

admin-panel-info-hero = <b>{$h_class} ({$h_name})</b>
                        🔼 Уровень: {$lvl}
                        ✨ Опыт: {$xp}
                        {$progress}

                        💰 Коины: {$coins}
                        🏫 Уровень школы: {$school_stars}

                        ➕ За урок: +20 XP и {$reward} 💰

registration-preview = Привет!
                    Добро пожаловать в учебное приключение 🎮
                    Здесь знания приносят награды, а герои растут вместе с тобой.

                    🔹 Выбери себе героя: воин, рыцарь, охотник, волшебник или чародей.
                    🔹 Затем придумай себе имя — это будет твой никнейм.
                    🔹 Проходи уроки, зарабатывай коины и опыт, прокачивайся и открывай награды!

                    Начнём с героя — кем ты  будешь в игре?
registration-hero-fighter = ⛏ Гном Лис! Настоящий мастер приключений!
registration-hero-knight = 🛡 Рыцарь Лис! Смелый защитник и храбрый воин!
registration-hero-ranger = 🏹 Эльф Лиса! Быстрый и ловкий!
registration-hero-sorcerer = 🔮 Волшебник Лис! Мудрый и загадочный!
registration-hero-wizard = 🧚 Фея Лиса! Мастер магических заклинаний!
registration-name = Придумай себе имя 🦊

                    Это будет твой игровой ник — его будут видеть другие.
                    Можно использовать как латиницу, так и кириллицу, от 4 до 20 символов. Цифры и подчёркивания — тоже разрешены.

                    Вот несколько примеров для вдохновения:

                    🔹 <i>Thorn_Elf</i>
                    🔹 <i>Гром_Лис</i>
                    🔹 <i>ZaraDark</i>
                    🔹 <i>Борисыч9</i>
                    🔹 <i>Raven123</i>

                    Как назовём твоего лиса? ✍️
my-hero-preview = <b>{$h_class} ({$h_name})</b>
                🔼 Уровень: {$lvl}
                ✨ Опыт: {$xp}
                {$progress}

                💰 Коины: {$coins}
                🏫 Уровень школы: {$school_stars}

                ➕ За урок: +20 XP и {$reward} 💰
my-hero-school = 🏫 Магическая школа Лисхолл
                Здесь обучаются самые отважные и хитрые лисы, чтобы стать мастерами своего дела.
                Каждый новый уровень школы — это не просто престиж, но и бонус к награде за уроки. Чем выше твой ранг, тем больше опыта и коинов ты получаешь!

                Прокачивай школу — и знания станут ещё ценнее. 📚✨

                🏫 Уровень школы: {$school_stars}
                💰 Стоимость прокачки: {$cost} коинов

my-hero-rating = 🏆 Топ-30 игроков:

                    {$heroes}

hero-fighter = ⛏ Гном Лис
hero-knight = 🛡 Рыцарь Лис
hero-wizard = 🧚 Фея Лиса
hero-ranger = 🏹 Эльф Лиса
hero-sorcerer = 🔮 Волшебник Лис
hero-id-fighter = fighter
hero-id-knight = knight
hero-id-wizard = wizard
hero-id-ranger = ranger
hero-id-sorcerer = sorcerer

err-add-hero = Ошибка при создании героя. Обратись к преподавателю.
err-input-name = Хм... Попробуй другой ник 🦊

                Возможно, такое имя уже занято — или оно слишком короткое (меньше 4 символов) или длинное (больше 20).
                Имя может содержать буквы (латиницу или кириллицу), цифры и подчёркивания.

                Попробуй немного изменить его — добавь число, символ или выбери новый образ!

                Например:
                🔹 Грозный_Лис9
                🔹 LunaFox_22
                🔹 Молния_Ро
                🔹 ShadowTail

                Введи новый никнейм ✍️
err-input-summ = Ожидаю на вход только числа, ни каких букв!
ur-reward-coins = Твоя награда сегодня {$coins} коинов!
ur-reward-xp = Твоя награда сегодня {$xp} опыта!
ur-reward-none = Сегодня тебе ничего не выпало. Попробуй завтра!
lvl-up = Уровень повышен! Теперь у тебя уровень {$lvl}!
max-lvl-school = Школа уже максимального уровня, и не требует
lvl-hero = Уровень {$lvl}
coins-lessons = 💰 {$coins} за урок

btn-next = Далее ➡️
btn-back = ⬅️ Назад
btn-school = 🏫 Школа
btn-daily-reward = 🎁 Получить награду дня
btn-rating = 🏆 Рейтинг
btn-upgrade-school = ⭐️ Прокачать школу
btn-accrual = ➕ Начислить
btn-write-off = ➖ Списать
btn-list-heroes = Список героев 📜
btn-settings-heroes = ➕ Начислить/➖Списать
btn-confirm = ✅ Подтвердить