admin-panel-menu = Ты админ 👑!
                   Какой функционал доступен.

                   🔹 <b>Список героев 📜</b> — предоставляет список всех учеников для просмотра.

                   🔹 <b>➕ Начислить/➖Списать</b> — Начислить или списать коины у группы учеников.

                   🔹 <b>➕ Начислить коины</b> — Начислить введенную сумму у группы учеников.

                   🔹 <b>📢 Написать всем</b> — Написать всем пользователям.

                   🔹 <b>🏆 Рейтинг</b> — Best of 30!
admin-panel-list-heroes = Для просмотра определенного ученика, выбери его из списка.
admin-panel-input-usernames = Введи список ников через запятую. Регистр важен.
                              <i>Прим.: Thorn_Elf, Борисыч9, ZaraDark </i>
admin-panel-input-msg = Введи текст сообщения, которое будет отправлено всем ученикам.
admin-panel-list-fill-usernames = Вот список найденных учеников. И только тебе решать что с ними делать.

                            🔹 <b>➕ Начислить</b> — всем: +20 XP и коины по формуле

                            🔹 <b>➖ Списать</b> — вводится сумма, списывается у всех введённых
admin-panel-list-empty-usernames = Увы, но мне не удалось найти учеников. Проверь правильность ников.
admin-panel-input-summ = Введи сумму для списания.
admin-panel-input-accrual-summ = Найденные ученики: {$users}

                                 Введите количество коинов для начисления.
admin-msg-accrual = Тебе начислено <b>{$coins} коинов!</b> 💰
admin-msg-debt = У тебя списано <b>{$coins} коинов!</b> 💰
admin-msg-daily-rewards = Ты получил <b>20 XP и {$coins} коинов за урок!</b>📖✨
admin-panel-info-hero = <b>{$h_class} ({$h_name})</b>
                        🔼 Уровень: {$lvl}
                        ✨ Опыт: {$xp}
                        {$progress}

                        💰 Коины: {$coins}
                        🏫 Уровень школы: {$school_stars}

                        ➕ За урок: +20 XP и {$reward} коин 💰

registration-preview = Привет!
                    Добро пожаловать в учебное приключение 🎮
                    Здесь знания приносят награды, а герои растут вместе с тобой.

                    🔹 Выбери себе героя: рыцарь, гном, эльф, фея или волшебник.
                    🔹 Затем придумай себе имя — это будет твой никнейм.
                    🔹 Проходи уроки, зарабатывай коины и опыт, прокачивайся и открывай награды!

                    Начнём с героя — кем ты  будешь в игре?
registration-hero-fighter = Гном Лис ⛏ - Настойчивый мастер. Шаг за шагом строит фундамент знаний.
registration-hero-knight = Рыцарь Лис🛡 - Смелый защитник знаний. Он всегда готов сражаться с ленью и скукой.
registration-hero-ranger = Эльф Лиса 🏹 - Быстрая и мудрая. Помогает точно попадать в цель и быстро мыслить.
registration-hero-sorcerer = Волшебник Лис 🔮 - Хранитель великих тайн. Открывает секреты и прокачивает интеллект.
registration-hero-wizard = Фея Лиса 🧚 - Волшебница вдохновения. Превращает занятия в сказочные приключения.
registration-name = Придумай себе имя 🦊

                    Это будет твой игровой ник — его будут видеть другие.
                    Тебе нужно придумать ник на русском языке, от 4 до 20 символов.
                    Цифры и подчёркивания — тоже разрешены.

                    Вот несколько примеров для вдохновения:

                    🔹 <i>Алексей007</i>
                    🔹 <i>Гром_Лис</i>
                    🔹 <i>Анна_Фея</i>
                    🔹 <i>Паша_Пират</i>

                    ⚠️Очень важно: Ник не должен содержать оскорбительных слов и цифр, иначе коины начисляться не будут.

                    Как назовём твоего лиса? 🥷
my-hero-preview = <b>{$h_class} ({$h_name})</b>
                🔼 Уровень: {$lvl}
                ✨ Опыт: {$xp}
                {$progress}

                💰 Коины: {$coins}
                🏫 Уровень школы: {$school_stars}

                ➕ За урок: +20 XP и {$reward} коин 💰
my-hero-school = 🏫 Магическая школа Лисхолл
                Здесь обучаются самые отважные и хитрые лисы, чтобы стать мастерами своего дела.
                Каждый новый уровень школы — это не просто престиж, но и бонус к награде за уроки. Чем выше твой ранг, тем больше опыта и коинов ты получаешь!

                Прокачивай школу — и знания станут ещё ценнее. 📚✨

                🏫 Уровень школы: {$school_stars}
                💰 Стоимость прокачки: {$cost} коинов

my-hero-rating = 🏆 Топ-30 игроков:

                    {$heroes}

hero-fighter = ⛏ Гном Лис
hero-knight = 🛡 Рыцарь Лис
hero-wizard = 🧚 Фея Лиса
hero-ranger = 🏹 Эльф Лиса
hero-sorcerer = 🔮 Волшебник Лис
hero-id-fighter = fighter
hero-id-knight = knight
hero-id-wizard = wizard
hero-id-ranger = ranger
hero-id-sorcerer = sorcerer

err-add-hero = Ошибка при создании героя. Обратись к преподавателю.
err-input-name = Хм... Попробуй другой ник 🦊

                Возможно, такое имя уже занято — или оно слишком короткое (меньше 4 символов) или длинное (больше 20).
                Ник может содержать буквы на русском языке, цифры и подчёркивания.

                Попробуй немного изменить его — добавь число, символ или выбери новый образ!

                Например:
                🔹 <i>Алексей007</i>
                🔹 <i>Гром_Лис</i>
                🔹 <i>Анна_Фея</i>
                🔹 <i>Паша_Пират</i>

                Введи новый никнейм ✍️
err-input-summ = Ожидаю на вход только числа, ни каких букв!
ur-reward-coins = Твоя награда сегодня {$coins} коинов!
ur-reward-xp = Твоя награда сегодня {$xp} опыта!
ur-reward-none = Сегодня тебе ничего не выпало. Попробуй завтра!
lvl-up = Уровень повышен! Теперь у тебя уровень {$lvl}!
max-lvl-school = Школа уже максимального уровня, и не требует
lvl-hero = Уровень {$lvl}
coins-lessons = 💰 {$coins} за урок

btn-next = Далее ➡️
btn-back = ⬅️ Назад
btn-school = 🏫 Школа
btn-daily-reward = 🎁 Получить награду дня
btn-rating = 🏆 Рейтинг
btn-upgrade-school = ⭐️ Прокачать школу
btn-accrual = ➕ Начислить
btn-coins-accrual = ➕ Начислить коины
btn-write-off = ➖ Списать
btn-list-heroes = Список героев 📜
btn-settings-heroes = ➕ Начислить/➖Списать
btn-confirm = ✅ Подтвердить
btn-cancel = Отменить
btn-write-everyone = 📢 Написать всем
btn-update = Обновить